# Ex3 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [3]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|', index_col='user_id')

### Step 4. See the first 3 entries

three different solutions

In [6]:
users.head(3)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067

In [37]:
users.loc[:3, :]

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067

In [38]:
users.iloc[:3, :]

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067

### Step 5. See the last 4 entries

three different solutions

In [39]:
users.tail(4)

         age gender     occupation zip_code
user_id
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [43]:
users.loc[(users.shape[0])-3:, :]

         age gender     occupation zip_code
user_id
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [44]:
users.iloc[-4:, :]

         age gender     occupation zip_code
user_id
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [8]:
users.shape[0]

943

### Step 7. What is the number of columns in the dataset?

In [9]:
users.shape[1]

4

### Step 8. Print the name of all the columns.

In [10]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed?

In [11]:
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### Step 10. What is the data type of each column?

In [14]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. Print only the occupation column

two different solutions

In [15]:
users.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [45]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations are in this dataset?

In [20]:
users.occupation.nunique()

21

### Step 13. What is the most frequent occupation?

In [22]:
users.occupation.value_counts().head()

student          196
other            105
educator          95
administrator     79
engineer          67
Name: occupation, dtype: int64

In [23]:
users.occupation.value_counts().index[0]

'student'

In [24]:
users.occupation.value_counts()[0]

196

### Step 14. Summarize the DataFrame.

In [27]:
users.describe().T.round(2)

     count   mean    std  min   25%   50%   75%   max
age  943.0  34.05  12.19  7.0  25.0  31.0  43.0  73.0

In [25]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

### Step 15. Summarize all the columns

In [47]:
users.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
age,943.0,NaN,NaN,NaN,34.051962,12.19274,7.0,25.0,31.0,43.0,73.0
gender,943,2,M,670,NaN,NaN,NaN,NaN,NaN,NaN,NaN
occupation,943,21,student,196,NaN,NaN,NaN,NaN,NaN,NaN,NaN
zip_code,943,795,55414,9,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Step 16. Summarize only the occupation column

In [49]:
users.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [30]:
users.age.mean()

34.05196182396607

In [31]:
round(users.age.mean(), 2)

34.05

### Step 18. What is the age with least occurrence?

In [36]:
users.age.value_counts(ascending=True).head(10)

73    1
10    1
66    1
7     1
11    1
69    2
64    2
68    2
62    2
70    3
Name: age, dtype: int64

In [35]:
users.age.value_counts().nsmallest()

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64